# Homebrew bundle for macOS production-like dev environment
# Core tooling
brew "bun"
brew "git"
brew "gh"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fzf"
brew "lazygit"
brew "lazydocker"
brew "python@3.13"
brew "uv"
brew "rust"
brew "openjdk@17"

# Containers & infra
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"

# Flutter ecosystem
cask "flutter"
cask "android-commandlinetools"

# C/C++ toolchain
brew "cmake"
brew "ninja"
brew "conan"
brew "vcpkg"
brew "ccache"
brew "cppcheck"
brew "llvm"
brew "clang-format"
brew "googletest"

# Runtime tooling
cask "orbstack"

# Productivity + terminal
brew "httpie"
brew "wget"
brew "tree"
brew "htop"
brew "ncdu"
brew "bat"
brew "fd"
brew "eza"
brew "tmux"
brew "zoxide"

# quality
brew "pkg-config"
